2022-04-13

------------------------

# 되짚어보기!!

> 람다 함수를 사용하는 이유   
> 1) 메모리에 함수의 원형이 저장되지 않음   
> 2) 일반 함수보다 쉽고 간단

> lambda 입력파라메터리스트: 처리내용(반환)

In [1]:
lambda x: x + 1

In [2]:
(lambda x: x + 1)(10)

11

In [3]:
add = lambda x: x + 1

In [4]:
add(100)

101

### 1. map 함수

> map 함수는 많은 양의 데이터(예, 리스트)를 하나씩 꺼내서 함수를 map시켜 실행해준다.   
> map 함수의 결과는 무조건 map 객체이므로, map 함수의 결과를 사용하고자 하는 경우, list로 캐스팅시켜준다

In [5]:
list_data = [1, 2, 3]

In [6]:
map(add, list_data)

In [7]:
list(map(add, list_data))

[2, 3, 4]

##### **문제1 : 입력값이 양수이면 "양수", 음수이면 "음수" 람다함수를 만들어보세요**

In [8]:
list_data2 = [10, 20, -30, -40, 50]

In [9]:
p_n = lambda x: "양수" if x > 0 else "음수"

In [10]:
result_pn = list(map(p_n, list_data2))

In [11]:
result_pn

['양수', '양수', '음수', '음수', '양수']

In [12]:
import pandas as pd
import numpy as np

In [13]:
df1 = pd.DataFrame({
    'name' : ['홍길동', '김길동', '홍순신', '정길동', '송사임'],
    'age' : [100, 200, 300, 150, 250]
})
df1

  name  age
0  홍길동  100
1  김길동  200
2  홍순신  300
3  정길동  150
4  송사임  250

In [14]:
df1['result'] = result_pn
df1

  name  age result
0  홍길동  100     양수
1  김길동  200     양수
2  홍순신  300     음수
3  정길동  150     음수
4  송사임  250     양수

##### **문제 2. 200 이상이면 고령, 미만이면 보통인 lambda 함수 만들기**

In [15]:
age_lambda = lambda x: '고령' if x >= 200 else '보통'

In [16]:
age_result = list(map(age_lambda, df1['age']))

In [17]:
age_result

['보통', '고령', '고령', '보통', '고령']

> map(함수, 리스트형태의 자료구조)

In [18]:
df1['age_result'] = age_result
df1

  name  age result age_result
0  홍길동  100     양수         보통
1  김길동  200     양수         고령
2  홍순신  300     음수         고령
3  정길동  150     음수         보통
4  송사임  250     양수         고령

##### **문제 3. name에 '홍'이라는 글자를 포함하고 있으면 1, 아니면 0인 람다 함수를 만들어보자**

In [19]:
name_lambda = lambda x: 1 if '홍' in x else 0

In [20]:
name_result = list(map(name_lambda, df1['name']))
name_result

[1, 0, 1, 0, 0]

In [21]:
df1['name_result'] = name_result
df1

  name  age result age_result  name_result
0  홍길동  100     양수         보통            1
1  김길동  200     양수         고령            0
2  홍순신  300     음수         고령            1
3  정길동  150     음수         보통            0
4  송사임  250     양수         고령            0

In [22]:
"홍" in "홍길동"

True

> 문자 in 문자열 : 문자열 안에 문자가 있는지, 있으면 True, 없으면 False가 출력   
> in의 결과는 항상 bool

In [23]:
1 not in [1, 2, 3]

False

##### **문제 4. 참석 확인하려고 하는 이름이 '홍길동', 참석자 리스트가 '김길동, '박길동', '송길동'인지 확인해보자!!**

In [24]:
'홍길동' in ['김길동', '박길동', '송길동']

False

In [25]:
name_list = ['김길동', '박길동', '송길동']

In [26]:
name = input("확인하고 싶은 이름을 입력하세요.")

확인하고 싶은 이름을 입력하세요. 홍길동

In [27]:
if name in name_list:
    print("참석자 명단에 있습니다.")
else:
    print("참석자 명단에 없습니다.")

참석자 명단에 없습니다.

In [28]:
'홍길동'.find('홍')

0

##### **문제 5. 일반함수와 람다함수로 이름을 입력받아 판단하는 함수를 구현해보자**

In [29]:
def find_name(x):
    if x in name_list:
        print(x)
    else:
        print('그런 사람 없습니다')

In [30]:
name_list = ['김길동', '박길동', '송길동']

In [31]:
name = input('이름을 입력하세요.')

이름을 입력하세요. 홍길동

In [32]:
find_name(name)

그런 사람 없습니다

In [33]:
find_name1 = lambda x: x if x in name_list else "그런 사람 없습니다"

In [34]:
find_name1('김길동')

'김길동'

### 2. filter 함수

In [35]:
name_result = list(filter(name_lambda, df1['name']))
name_result

['홍길동', '홍순신']

> map은 true / false의 결과를 모두 다 return   
> filter는 true의 결과만을 return

##### **문제 6. result 변수 값이 양수이면 1, 음수이면 0으로 바꿔보자!!**

In [36]:
result_lambda = lambda x: 1 if x == '양수' else 0

In [37]:
df1['result'] = list(map(result_lambda, df1['result']))
df1

  name  age  result age_result  name_result
0  홍길동  100       1         보통            1
1  김길동  200       1         고령            0
2  홍순신  300       0         고령            1
3  정길동  150       0         보통            0
4  송사임  250       1         고령            0

In [38]:
list(map(lambda x: 1 if x == '고령' else 0, df1['age_result']))

[0, 1, 1, 0, 1]

##### **문제 7. age_result의 값이 고령이면 1, 아니면 0으로 변경해보자!!**

In [39]:
age_result_lamda = lambda x: 1 if x == '고령' else 0

In [40]:
# def age_result_lamda(x):
#     if x == '고령':
#         return 1
#     else:
#         return 0

In [41]:
df1['age_result'] = list(map(age_result_lamda, df1['age_result']))

In [42]:
df1

  name  age  result  age_result  name_result
0  홍길동  100       1           0            1
1  김길동  200       1           1            0
2  홍순신  300       0           1            1
3  정길동  150       0           0            0
4  송사임  250       1           1            0

##### **문제 8. age를 100~199 => 0, 200~249 => 1, 나머지는 2로 변경해보자!!**

In [43]:
change_age = lambda x: 0 if 100 <= x < 200 else 1 if 200 <= x < 250 else 2

In [44]:
# def age_func(x):
#     if 100 <= x < 200:
#         return 0
#     elif 200 <= x < 250:
#         return 1
#     else:
#         return 2

In [45]:
df1['age'] = list(map(change_age, df1['age']))
df1

  name  age  result  age_result  name_result
0  홍길동    0       1           0            1
1  김길동    1       1           1            0
2  홍순신    2       0           1            1
3  정길동    0       0           0            0
4  송사임    2       1           1            0

### 3. apply 함수

> 컬럼명.apply(함수)

In [46]:
df1.columns

Index(['name', 'age', 'result', 'age_result', 'name_result'], dtype='object')

In [47]:
df1['age'].apply(lambda x: x + 1)

0    1
1    2
2    3
3    1
4    3
Name: age, dtype: int64

> 현재 비파괴 상태

In [48]:
df1['ageplus1'] = df1['age'].apply(lambda x: x + 1)
df1

  name  age  result  age_result  name_result  ageplus1
0  홍길동    0       1           0            1         1
1  김길동    1       1           1            0         2
2  홍순신    2       0           1            1         3
3  정길동    0       0           0            0         1
4  송사임    2       1           1            0         3

##### **문제 9. 일반함수를 만들어 apply를 적용해보고 이름의 첫글자가 송으로 시작하면 '송' 아니면 첫글자에 해당하는 글자를 출력해보자**

In [49]:
def name_first(x):
    if x[0] == '송':
        return '송'
    else:
        return x[0]

In [50]:
# result_name = []
# for x in df1['name']:
#     if x[0] == '송':
#         result_name.append('송')
#     else:
#         result_name.append(x[0])
# result_name

In [51]:
df1['name_apply'] = df1['name'].apply(name_first)

In [52]:
df1

  name  age  result  age_result  name_result  ageplus1 name_apply
0  홍길동    0       1           0            1         1          홍
1  김길동    1       1           1            0         2          김
2  홍순신    2       0           1            1         3          홍
3  정길동    0       0           0            0         1          정
4  송사임    2       1           1            0         3          송